Revit 2024 API
BuiltInFailures.StairRampFailures.StairsCrossingRisersDisallowedFailure Property
 Crossing risers are not allowed
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId StairsCrossingRisersDisallowedFailure { get; }
Visual Basic
Public Shared ReadOnly Property StairsCrossingRisersDisallowedFailure As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ StairsCrossingRisersDisallowedFailure {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.StairRampFailures Class
Autodesk.Revit.DB Namespace